## Create an array of 10 zeros but set the fifth element to 1

In [3]:
import numpy as np
my_array = np.zeros(10)
my_array[4] = 1
   
    
my_array

array([0., 0., 0., 0., 1., 0., 0., 0., 0., 0.])

### Create a 4x4 matrix with values ranging from 0 to 15.

In [7]:
my_matrix = np.arange(16).reshape (4,4)


my_matrix

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

### Array Operations¶

In [ ]:

3. Create two NumPy arrays: Perform element-wise addition, subtraction, multiplication, and division.
arr1: array([[41, 30, 10], [ 6, 35, 23], [23, 9, 10]])
arr2: array([[4, 29, 2], [5, 13, 3], [24, 16, 7]])

In [ ]:
# solution
# addition: arr1 + arr2

# subtraction: arr1 - arr2 

# division: arr1 / arr2

# multiplication: arr1 * arr2

In [7]:
import numpy as np
arr1 = np.array([[41, 30, 10], [ 6, 35, 23], [23, 9, 10]])
arr2 = np.array([[4, 29, 2], [5, 13, 3], [24, 16, 7]])
sum_arr = ([arr1 + arr2])
diff_arr = ([arr1 - arr2])
product_arr = ([arr1 * arr2])
div_arr = ([arr1 / arr2])
print(sum_arr)
print(diff_arr)
print(product_arr)
print(div_arr)

[array([[45, 59, 12],
       [11, 48, 26],
       [47, 25, 17]])]
[array([[37,  1,  8],
       [ 1, 22, 20],
       [-1, -7,  3]])]
[array([[164, 870,  20],
       [ 30, 455,  69],
       [552, 144,  70]])]
[array([[10.25      ,  1.03448276,  5.        ],
       [ 1.2       ,  2.69230769,  7.66666667],
       [ 0.95833333,  0.5625    ,  1.42857143]])]

### Array Slicing

In [ ]:

4. Given the array:
arr = np.array([10, 20, 30, 40, 50, 60, 70, 80, 90, 100])
Extract elements from index 2 to 6.

In [23]:
arr2 = np.array([10, 20, 30, 40, 50, 60, 70, 80, 90, 100])
sliced = arr2[2:7]
print(sliced)

[30 40 50 60 70]

### Using NumPy Methods

In [ ]:
Using NumPy Methods¶
5. Convert the array below to a 3×3 NumPy array.
array([[15, 18, 20], [15, 30, 8], [25, 30, 60]])
Find the mean, sum, and maximum value.

In [35]:
arr3 = np.array([[15, 18, 20], [15, 30, 8], [25, 30, 60]])
arr3_mean = round(np.mean(arr3), 2)
arr3_sum = np.sum(arr3)
arr3_max = np.max(arr3)

print(arr3)
print(arr3_mean) # Mean rounded to two decimal points
print(arr3_sum)
print(arr3_max)

[[15 18 20]
 [15 30  8]
 [25 30 60]]
24.56
221
60

# Task 2: Pandas Basics

### Creating a Pandas Series

In [ ]:

1. Create a Pandas Series from the list [10, 20, 30, 40, 50] with index labels 'a', 'b', 'c', 'd', 'e'.

In [41]:
import pandas as pd
series = pd.Series([10, 20, 30, 40, 50], index = ['a', 'b', 'c', 'd', 'e'])
series

a    10
b    20
c    30
d    40
e    50
dtype: int64

### Reading a CSV File

In [ ]:

2. Read a CSV file named "data.csv" into a Pandas DataFrame. The CSV file has the following columns: "Name", "Age", "Salary".

In [75]:
df = pd.read_csv(r"C:\Users\youg_\python-numpy-pandas-group-b-YougOsti\data\data.csv")

df

       Name  Age  Salary
0     Alice   29   73193
1       Bob   53   85398
2   Charlie   36   47162
3     David   22   65853
4       Eve   24   36168
5     Frank   58   69657
6     Grace   41   85202
7    Hannah   38   62421
8     Isaac   50   74641
9      Jack   47   38963
10    Karen   34   32136
11      Leo   49   41874
12     Mona   56   34070
13     Nina   49   91734
14    Oscar   30   89539
15     Paul   23   78720
16    Quinn   31   54424
17   Rachel   54   59900
18    Steve   36   32163
19     Tina   56   52054

### Slicing a DataFrame

In [ ]:
3. From the DataFrame created in Exercise 2, select only the first three rows.

In [77]:
sliced_df = df.head(3)
sliced_df

      Name  Age  Salary
0    Alice   29   73193
1      Bob   53   85398
2  Charlie   36   47162

### Manipulating a DataFrame - Adding a Column

In [73]:
### 4. Add a new column named "Tax" to the DataFrame from Exercise 2. The tax should be calculated as 10% of the "Salary" column.

In [79]:
df["Tax"] = df["Salary"] * .10
df

       Name  Age  Salary     Tax
0     Alice   29   73193  7319.3
1       Bob   53   85398  8539.8
2   Charlie   36   47162  4716.2
3     David   22   65853  6585.3
4       Eve   24   36168  3616.8
5     Frank   58   69657  6965.7
6     Grace   41   85202  8520.2
7    Hannah   38   62421  6242.1
8     Isaac   50   74641  7464.1
9      Jack   47   38963  3896.3
10    Karen   34   32136  3213.6
11      Leo   49   41874  4187.4
12     Mona   56   34070  3407.0
13     Nina   49   91734  9173.4
14    Oscar   30   89539  8953.9
15     Paul   23   78720  7872.0
16    Quinn   31   54424  5442.4
17   Rachel   54   59900  5990.0
18    Steve   36   32163  3216.3
19     Tina   56   52054  5205.4

In [ ]:
#  Filter the dataframe by the column "age" whereby the age is above 36 years

In [81]:
df.loc[df["Age"] > 36]

      Name  Age  Salary     Tax
1      Bob   53   85398  8539.8
5    Frank   58   69657  6965.7
6    Grace   41   85202  8520.2
7   Hannah   38   62421  6242.1
8    Isaac   50   74641  7464.1
9     Jack   47   38963  3896.3
11     Leo   49   41874  4187.4
12    Mona   56   34070  3407.0
13    Nina   49   91734  9173.4
17  Rachel   54   59900  5990.0
19    Tina   56   52054  5205.4

# Task 3: Data Analysis with Pandas

In [ ]:
# Given a dataset of sales transactions, compute the total and mean sales per region

In [86]:
# Sample Data
sales_data = pd.DataFrame({
    "Region": ["North", "South", "North", "West", "South", "West"],
    "Sales": [1000, 1500, 1200, 1800, 1300, 1700]
})
sales_data

  Region  Sales
0  North   1000
1  South   1500
2  North   1200
3   West   1800
4  South   1300
5   West   1700

In [88]:
# Regionwise Total and Mean Sales 
sales_summary = sales_data.groupby("Region")["Sales"].sum().to_frame(name="Total Sales")
sales_summary["Mean Sales"] = sales_data.groupby("Region")["Sales"].mean()
print(sales_summary)

        Total Sales  Mean Sales
Region
North          2200      1100.0
South          2800      1400.0
West           3500      1750.0

### Merging - Combine Customer and Order Data

In [ ]:
2. Merge customers and orders data based on CustomerID

In [97]:
customers = pd.DataFrame({
    "CustomerID": [1, 2, 3, 4],
    "CustomerName": ["Alice", "Bob", "Charlie", "David"]
})

orders = pd.DataFrame({
    "OrderID": [101, 102, 103, 104],
    "CustomerID": [1, 2, 2, 4],
    "Amount": [250, 400, 600, 150]
})


merged_df = pd.merge(customers, orders, on = "CustomerID", how = "inner")

merged_df

   CustomerID CustomerName  OrderID  Amount
0           1        Alice      101     250
1           2          Bob      102     400
2           2          Bob      103     600
3           4        David      104     150

In [ ]:
# Joining - Left Join Employee Data

In [5]:
# NB: No test for this. Just an exercise for you to play around with
employees = pd.DataFrame({
    "EmpID": [101, 102, 103, 104],
    "EmpName": ["John", "Jane", "Alice", "Bob"],
    "DeptID": [1, 2, 2, 3]
})

departments = pd.DataFrame({
    "DeptID": [1, 2],
    "DeptName": ["HR", "Finance"]
})

print(employees, departments)
merged_df = pd.merge(employees, departments, on="DeptID", how="left")
merged_df

   EmpID EmpName  DeptID
0    101    John       1
1    102    Jane       2
2    103   Alice       2
3    104     Bob       3    DeptID DeptName
0       1       HR
1       2  Finance

   EmpID EmpName  DeptID DeptName
0    101    John       1       HR
1    102    Jane       2  Finance
2    103   Alice       2  Finance
3    104     Bob       3      NaN

### Pivot Table - Summarize Sales Data

In [ ]:
## Create a pivot table showing total sales for each Region and Product

In [110]:
sales_pivot_data = pd.DataFrame({
    "Region": ["North", "North", "South", "South", "West", "West"],
    "Product": ["A", "B", "A", "B", "A", "B"],
    "Sales": [200, 300, 150, 400, 250, 500]
})
sales_pivot = sales_pivot_data.pivot_table(values="Sales", index="Region", columns="Product", aggfunc="sum")

sales_pivot_data
sales_pivot

Product    A    B
Region
North    200  300
South    150  400
West     250  500